app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @category = Category.find(category_params)
    @task.category = @category
    @task.save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-06-19 15:48:22.378422"], ["updated_at", "2019-06-19 15:48:22.378422"], ["title", "azazaz"], ["deadline", "2022-12-12 00:00:00"], ["category_id", 1]]

  def update
    @task = Task.find(params[:id])
    @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "deadline" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["deadline", nil], ["updated_at", "2019-06-24 16:55:43.762030"], ["id", 1]]